app/controllers/boats_controller.rb

  def index
    @boats = Boat.all
---
SELECT "boats".* FROM "boats"

  def create
    @boat = Boat.new(boat_params)

    respond_to do |format|
      if @boat.save
---
INSERT INTO "boats" ("name", "location", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "boatie Mc boat"], ["location", "Mars"], ["user_id", 1], ["created_at", 2016-07-13 21:07:39 UTC], ["updated_at", 2016-07-13 21:07:39 UTC]]

    def set_boat
      @boat = Boat.find(params[:id])
---
SELECT  "boats".* FROM "boats" WHERE "boats"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]