app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "boats".* FROM "boats" WHERE "boats"."user_id" = ?  [["user_id", 1]]
---
  def show
    @boats= User.find(params[:id]).boats

INSERT INTO "users" ("name", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "user"], ["password", "12345"], ["created_at", 2016-07-13 21:00:55 UTC], ["updated_at", 2016-07-13 21:00:55 UTC]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save